In [43]:
import pandas as pd

In [44]:
df = pd.read_csv('titanic.csv')
df.head(2)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [45]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace=True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [46]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [47]:
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [48]:
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [49]:
dummies = pd.get_dummies(df.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [50]:
df = pd.concat([inputs, dummies], axis = 'columns')
df.head()

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False
3       1  female  35.0  53.1000    True  False
4       3    male  35.0   8.0500   False   True

In [51]:
df.drop(['Sex'], axis = 'columns', inplace=True)
df.head()

   Pclass   Age     Fare  female   male
0       3  22.0   7.2500   False   True
1       1  38.0  71.2833    True  False
2       3  26.0   7.9250    True  False
3       1  35.0  53.1000    True  False
4       3  35.0   8.0500   False   True

In [52]:
df.drop('male', axis = 'columns', inplace = True)
df.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False

In [53]:
inputs = df

In [54]:
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False

In [55]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [56]:
inputs.Age[0:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [57]:
inputs.Age = inputs.Age.fillna(round(inputs.Age.mean()))
inputs[:10]

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False
5       3  30.0   8.4583   False
6       1  54.0  51.8625   False
7       3   2.0  21.0750   False
8       3  27.0  11.1333    True
9       2  14.0  30.0708    True

In [58]:
inputs.isna().any()

Pclass    False
Age       False
Fare      False
female    False
dtype: bool

In [59]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [60]:
len(x_train)

712

In [61]:
len(inputs)

891

In [62]:
len(x_test)

179

In [63]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [64]:
model.fit(x_train, y_train)

GaussianNB()

In [65]:
model.score(x_test, y_test)

0.7821229050279329

In [66]:
x_train[0:10]

     Pclass   Age     Fare  female
383       1  35.0  52.0000    True
622       3  20.0  15.7417   False
221       2  27.0  13.0000   False
614       3  35.0   8.0500   False
477       3  29.0   7.0458   False
826       3  30.0  56.4958   False
588       3  22.0   8.0500   False
245       1  44.0  90.0000   False
448       3   5.0  19.2583    True
49        3  18.0  17.8000    True

In [67]:
y_train[0:10]

383    1
622    1
221    0
614    0
477    0
826    0
588    0
245    0
448    1
49     0
Name: Survived, dtype: int64

In [69]:
model.predict(x_test[:10])

array([1, 1, 0, 0, 0, 0, 0, 1, 1, 0], dtype=int64)

In [70]:
y_test[:10]

472    1
849    1
252    0
433    0
839    1
652    0
103    0
796    1
501    0
743    0
Name: Survived, dtype: int64

In [71]:
model.predict_proba(x_test[:5])

array([[0.22284699, 0.77715301],
       [0.00925857, 0.99074143],
       [0.6834437 , 0.3165563 ],
       [0.95477481, 0.04522519],
       [0.73753995, 0.26246005]])

In [72]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(), x_train, y_train)

array([0.74125874, 0.81818182, 0.73943662, 0.76056338, 0.81690141])

In [74]:
from sklearn.naive_bayes import BernoulliNB
model = BernoulliNB()
model.fit(x_train, y_train)
model.score(x_test, y_test)

0.7932960893854749

In [75]:
cross_val_score(BernoulliNB(), x_train, y_train)

array([0.76223776, 0.83916084, 0.76056338, 0.74647887, 0.81690141])

In [ ]:
from sklearn.naive_bayes import CategoricalNB
model = CategoricalNB